dct = {
    "а": 'ка',
    "о": "мо",
    "в": "ру",
    "б": "зу",
    "г": "джи",
    "д": "те",
    "е": "ку",
    "ё": "ку",
    "ж": "зу",
    "з": "з",
    "и": "ки",
    "й": "фу",
    "к": "ме",
    "л": "та",
    "м": "рин",
    "н": "то",
    "о": "мо",
    "п": "но",
    "р": "ши",
    "с": "ари",
    "т": "чи",
    "у": "мей",
    "ф": "лу",
    "х": "ри",
    "ц": "ми",
    "ч": "зи",
    "ш": "ли",
    "щ": "ни",
    "ъ": "д",
    "ы": "хе",
    "ь": "ксе",
    "э": "га",
    "ю": "до",
    "я": "ма"
}

line = input().lower()
ans = ''

line = list(map(lambda x: dct[x], list(line)))

ans = "".join(line)
ans = ans[:1].upper() + ans[1:]
print(ans)
